<?php

$students=[
'judy'=>['國文'=>95,
         '英文'=>64,
         '數學'=>70,
         '地理'=>90,
         '歷史'=>84,
        ],
'amo'=>['國文'=>88,
         '英文'=>78,
         '數學'=>54,
         '地理'=>81,
         '歷史'=>71,
        ],


];

$subjects=[
    '國文'=>[
        'judy'=>95,
        'amo'=>88,
        'john'=>45,
        'peter'=>59,
        'hebe'=>71
    ],
    '英文'=>[
        'judy'=>64,
        'amo'=>78,
        'john'=>60,
        'peter'=>32,
        'hebe'=>62
    ],
    '數學'=>[],
    '地理'=>[],
    '歷史'=>[],
];

?>